Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/atdf/PIC32CK0512GC00100.atdf
      <value-group name="MVFR0__SIMDReg">
        <value name="1" caption="16 x 64-bit registers" value="1"/>
      </value-group>
      <value-group name="MVFR0__FPSP">
        <value name="YES" caption="Supported" value="2"/>
      </value-group>
      <value-group name="MVFR0__FPDP">
        <value name="YES" caption="Supported" value="2"/>
      </value-group>
      <value-group name="MVFR1__FPHP">
        <value name="SP" caption="Half-precision to single-precision supported" value="1"/>
        <value name="BOTH" caption="Half-precision to single- and double-precision supported" value="2"/>
      </value-group>
      <value-group name="MVFR2__FPMisc">
        <value name="YES" caption="Selection, directed conversion to integer, VMINNM, and VMAXNM supported" value="4"/>
      </value-group>
    </module>
    <module name="FREQM" id="03707" name2="clk_freqm_u2257_v3" version="3a0" caption="Frequency Meter">
      <register-group name="FREQM" caption="Frequency Meter">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x80" caption="Control A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="FREERUN" caption="Free Running Mode" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B Register">
          <bitfield name="START" caption="Start Measurement" mask="0x1"/>
        </register>
        <register name="CFGA" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Config A Register">
          <bitfield name="REFNUM" caption="Number of Reference Clock Cycles" mask="0xFF"/>
          <bitfield name="MSRSEL" caption="Measurement Clock Selection" mask="0x700" values="CFGA__MSRSEL"/>
          <bitfield name="DIVREF" caption="Divide Reference Clock" mask="0x8000" values="CFGA__DIVREF"/>
        </register>
        <register name="CTRLC" offset="0x4" rw="RW" size="1" initval="0x00" caption="Control C Register">
          <bitfield name="WINMODE" caption="Window Monitor Mode" mask="0x7" values="CTRLC__WINMODE"/>
        </register>
        <register name="EVCTRL" offset="0x6" rw="RW" size="1" initval="0x00" caption="Event Control Register">
          <bitfield name="STARTEI" caption="Start Measurement Event Input Enable" mask="0x1"/>
          <bitfield name="STARTINV" caption="Start Measurement Event Invert Enable" mask="0x2"/>
          <bitfield name="DONEEO" caption="Measurement Done Event Out" mask="0x10"/>
          <bitfield name="WINMONEO" caption="Window Monitor Event Out" mask="0x20"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Disable" mask="0x1"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Disable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Register">
          <bitfield name="DONE" caption="Measurement Done" mask="0x1"/>
          <bitfield name="WINMON" caption="Window Monitor" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0xB" rw="RW" size="1" initval="0x00" caption="Status Register">
          <bitfield name="BUSY" caption="FREQM Status" mask="0x1"/>
          <bitfield name="OVF" caption="Sticky Count Value Overflow" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Count Value Register">
          <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
        </register>
        <register name="WINLT" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Window Monitor Lower Threshold">
          <bitfield name="WINLT" caption="Window Lower Threshold" mask="0xFFFFFF"/>
        </register>
        <register name="WINUT" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Window Monitor Upper Threshold">
          <bitfield name="WINUT" caption="Window Upper Threshold" mask="0xFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CFGA__MSRSEL">
        <value name="GCLK" caption="GCLK Input Clock" value="0x0"/>
        <value name="CPU" caption="CPU Input Clock" value="0x1"/>
      </value-group>
      <value-group name="CFGA__DIVREF">
        <value name="DIV1" caption="The reference clock is divided by 1" value="0x0"/>
        <value name="DIV8" caption="The reference clock is divided by 8" value="0x1"/>
      </value-group>
      <value-group name="CTRLC__WINMODE">
        <value name="DISABLE" caption="No window mode (default)" value="0x0"/>
        <value name="MODE1" caption="VALUE &gt; WINLT" value="0x1"/>
        <value name="MODE2" caption="VALUE &lt; WINUT" value="0x2"/>
        <value name="MODE3" caption="WINLT &lt; VALUE &lt; WINUT" value="0x3"/>
        <value name="MODE4" caption="!(WINLT &lt; VALUE &lt; WINUT)" value="0x4"/>
      </value-group>
    </module>
    <module name="FUSES" id="fuses" name2="fuses" version="1a0" caption="Defines FUSE parameters">
      <register-group name="FUSES_BOOTCFG1" caption="Defines FUSE parameters">
        <register name="BLDRCFG" offset="0x0" rw="RW" size="4" access-size="4" caption="Bootloader Configuration">
          <bitfield name="PFM_BCRP" caption="Boot Configration Page Read Protect" mask="0x1"/>
          <bitfield name="PFM_BCWP" caption="Boot Configration Page Write Protect" mask="0x2"/>
          <bitfield name="BROM_EN_BFMCHK" caption="Enable BFM CRC Check" mask="0x10000000" values="BLDRCFG__BROM_EN_BFMCHK"/>
          <bitfield name="BROM_EN_PLL" caption="Enable PLL (Settings in PLL0_&lt;REGS&gt; are used)" mask="0x20000000"/>
          <bitfield name="BROM_EN_DALUN" caption="Enable DAL Unlock" mask="0x40000000"/>
          <bitfield name="BROM_EN_RWLOCKS" caption="Enable Read/Write Locks" mask="0x80000000"/>
        </register>
        <register name="BROM_BSEQ" offset="0x4" rw="RW" size="4" access-size="4" caption="Boot Configuraiton Page Sequence Number">
          <bitfield name="SEQNUM" caption="Sequence Number" mask="0xFFFF"/>
          <bitfield name="SEQBAR" caption="Sequence Number Bar (Negeated)" mask="0xFFFF0000"/>
        </register>
        <register name="BFM_CHK_TABLEPTR" offset="0x8" rw="RW" size="4" access-size="4" caption="BFM CRC Table Pointer">
        </register>
        <register name="KEYVAL_TZ1_CE_NS" offset="0x20" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Key for TZ1_NS">
        </register>
